package com.eran.myapp;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;
import android.widget.Toast;

import com.firebase.client.Firebase;
import com.squareup.picasso.Picasso;

import java.text.DateFormat;
import java.text.SimpleDateFormat;
import java.util.Calendar;
import java.util.Date;

public class fullad extends AppCompatActivity {

    ImageView imagefullad;
    String tip_race,race,name;
    TextView tip_animal;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_fullad);

        TextView tip_animal = findViewById(R.id.tip_animal2);


        name = getIntent().getStringExtra("name");
        TextView name_animal = findViewById(R.id.name_animal);
        if(name.equals("null"))
        {name_animal.setText("שם החיה: ");}
        else{name_animal.setText("שם החיה: " + name);}

        String imagefullad2 = getIntent().getStringExtra("image");
        imagefullad = findViewById(R.id.imageView4);
        Picasso.with(fullad.this).load(imagefullad2).into(imagefullad);


        final String type = getIntent().getStringExtra("type");
        TextView type_animal = findViewById(R.id.type_animal);
        if(type.equals("null"))
        {type_animal.setText("סוג החיה: ");}
        else{type_animal.setText("סוג החיה: " + type);}

        String Purpose = getIntent().getStringExtra("Purpose");
        TextView Purpose_animal = findViewById(R.id.Purpose_animal);
        if(Purpose.equals("null"))
        {Purpose_animal.setText("מטרת המודעה: " );}
        else{Purpose_animal.setText("מטרת המודעה: " + Purpose);}

        String age = getIntent().getStringExtra("age");
        TextView age_animal = findViewById(R.id.age_animal);
        if(age.equals("null"))
        {age_animal.setText("גיל: " );}
        else{age_animal.setText("גיל: " + age);}

        String information = getIntent().getStringExtra("information");
        TextView information_animal = findViewById(R.id.information_animal);
        if(information.equals("null"))
        {information_animal.setText("מידע נוסף: " );}
        else{information_animal.setText("מידע נוסף: " + information);}

        String city = getIntent().getStringExtra("city");
        TextView city_animal = findViewById(R.id.city_animal);
        if(city.equals("null"))
        {city_animal.setText("עיר: " );}
        else{city_animal.setText("עיר: " + city);}

        race = getIntent().getStringExtra("race");
        TextView race_animal = findViewById(R.id.race_animal);
        if(race.equals("null"))
        {race_animal.setText("גזע: ");}
        else{race_animal.setText("גזע: " + race);}

        String training = getIntent().getStringExtra("training");
        TextView training_animal = findViewById(R.id.traininganimal);
        if(training.equals("null"))
        {training_animal.setText("רמת אילוף:  " );}
        else{training_animal.setText("רמת אילוף:  " + training);}

        String state = getIntent().getStringExtra("state");
        TextView state_animal = findViewById(R.id.state_animal);
        if(state.equals("null"))
        {state_animal.setText("אזור:  ");}
        else {state_animal.setText("אזור:  " + state);}

        String gender = getIntent().getStringExtra("gender");
        TextView gender_animal = findViewById(R.id.gender_animal);
        if(gender.equals("null"))
        {gender_animal.setText("מין:  "); }
        else{gender_animal.setText("מין:  " + gender);}

        String date = getIntent().getStringExtra("date");
        TextView date_animal = findViewById(R.id.date_animal);
        date_animal.setText("תאריך:  " + date);

        String firstname = getIntent().getStringExtra("firstname");
        TextView firstnamePerson = findViewById(R.id.firstname5);
        if(firstname.equals("null"))
        {firstnamePerson.setText("שם פרטי:  " ); }
        else{firstnamePerson.setText("שם פרטי:  " + firstname);}

        String lastname = getIntent().getStringExtra("lastname");
        TextView lastnamePerson = findViewById(R.id.lastname5);
        if (lastname.equals("null"))
        {lastnamePerson.setText("שם משפחה:  ");}
        else{lastnamePerson.setText("שם משפחה:  " + lastname); }

        String email = getIntent().getStringExtra("email");
        TextView emailPerson = findViewById(R.id.email5);
        if (email.equals("null"))
        {emailPerson.setText("אימייל:  ");}
        else{emailPerson.setText("אימייל:  " + email); }


        String phone = getIntent().getStringExtra("phone");
        TextView phonePerson = findViewById(R.id.phone5);
        if(phone.equals("null"))
        { phonePerson.setText("פלאפון:  " ); }
        else{phonePerson.setText("פלאפון:  " + phone);}


        if (race.equals("בוקסר")) {
            tip_race = "תוחלת חיים ממוצעת 10-12 שנים.\n" +
                    "מתאים לגידול בדירה.\n" +
                    "ידידותי לסביבה עם ילדים .\n" +
                    "קל לאילוף ומומלץ לאלף אותם בגיל קטן.\n" +
                    "כלבים נאמנים.\n" +
                    "הבוקסרים הם כלבים גדולים והם זקוקים לפחות לשעה של פעילות גופנית טובה מדי יום. חובבי הריצה ימצאו מלווים מושלמים לאימוני הריצה שלהם\n" +
                    "אם יש לכם חצר גדולה, אתם חייבים לדאוג לכך שהגדר שלה תהיה מספיק בטוחה. כלבי הבוקסר יודעים לפרוץ מנעולים ולקפוץ מעל גדרות ויש להם נטייה לברוח – נטייה זו פוחתת אם הם מעוקרים. \n" +
                    "מבחינה בריאותית-- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "חירשות (הנתונים כיום אומרים שהאפשרות לחירשות אצל הבוקסר באוזן אחת, או בשתי אוזניים היא בין 20%-40%), הפרעות בויסות החום, הפרעות מטבוליות אותן בדרך כלל ניתן לפתור או להפחית באמצעות דיאטה מתאימה. עיוות עפעפיים הוא גם תופעה אופיינית אצל הבוקסר, ניתן לתקן זאת באמצעות ניתוח.\n";
        }
        if (race.equals("אמסטף")) {
            tip_race = "תוחלת חיים ממוצעת 12-16 שנים.\n" +
                    "כלב המיועד בעיקר לשמירה . \n" +
                    "כאשר הוא מאולף באופן מקצועי ועדיף מגיל צעיר  - כלב האמסטף יכול להסתדר גם עם חיות מחמד אחרות.\n" +
                    "לכלב האמסטף אופי נוח והוא בעל סבלנות גדולה מאוד. כלבים אלו יכולים לשמש ככלבי שמירה טובים, אבל כל זאת בתנאי שהם עברו אילוף נכון ומקצועי, שיכול לדכא את הנטייה שלהם לתוקפנות.\n" +
                    "האמסטפים אוהבים פעילות גופנית וזקוקים לה. חשוב לספק לו מקום גדול ובטוח להתרוצץ בו.\n" +
                    "האמסטף צריך ללמוד כיצד להתנהג בתוך הבית והמשפחה ואתם חייבים לדכא אצלו לחלוטין התנהגות טריטוריאלית וגם לדכא את הדחף שלהם לברוח. \n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן(כלב זה לרוב בעל מערכת חיסונית חזקה מאוד) :\n" +
                    "מפרק ירך פגום שעלול לגרום לו לדלקת פרקים, צליעה וכאב, קטרקט אשר יכול בסופו של דבר להוביל לעיוורון, פיתול קיבה האופייני לכלבים גדולים, בעיות בעור, חירשות והיפוך העפעף פנימה שיכול להצריך ניתוח. קל מאוד לטפח את הפרווה הקצרה שלו.\n";
        }
        if (race.equals("בולדוג אמריקאי")) {
            tip_race = "כלב ידידותי לסביבה , מתאים לגידול עם ילדים ומתאים לגידול בתוך דירה.\n" +
                    "נאמנים ומסורים לבעלים שלהם באופן מוחלט.\n" +
                    "לא מסתדר עם בעלי חיים אחרים .\n" +
                    "כאשר אתה מחליט לאלף את האמריקן בולדוג שלך, אתה חייב להיות מוכן לכך, אם לא תהיה מוכן, גזע זה נוטה להשתעמם בקלות ובסופו של דבר הוא יוציא את האנרגיה על רהיטים, שטיחים, נעליים וכדומה. נכון שהוא זקוק רק לשעה ביום של אילוף, אבל זו חייבת להיות שעה שמוקדשת אך ורק למען מטרה זו. האילוף של הגזע צריך להתחיל מוקדם ככל האפשר, הם לא יסתדרו עם אילוף חמור מידי, האילוף שלהם צריך להיות הוגן, עקבי ומלא בסבלנות. \n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "דיספלסיה של מפרק  הירך שיכולה לגרום לכאבים וקושי בעמידה או הליכה. בעיות בעיניים, אלרגיה של העור, בעיות חיסוניות וחירשות.\n";
        }

        if (race.equals("בולדוג אנגלי")) {
            tip_race = "תוחלת חיים ממוצעת 7-9 שנים .\n" +
                    "הבולדוג האנגלי הוא כלב מסור ונאמן. כלבים אלו דורשים המון תשומת לב\n" +
                    " ולכן הם לא יתאימו לבעלים שצריך להשאיר אותם לבדם למשך פרקי זמן ממושכים.\n" +
                    " לכלב הבולדוג האנגלי יהיה קשר חזק מאוד עם המשפחה שלו ולעיתם קרובות הם מתקשים להסתגל מחדש למשפחה אחרת, בנוסף הם כלבים שמסתדרים מצוין עם ילדים וקשישים.\n" +
                    "בגלל שהבולדוג האנגלי אוהב לרצות הוא ילמד מהר מאוד מה הבעלים שלו דורש ממנו. האינטליגנציה הגבוהה שלהם הופכת אותם מצוינים לאילוף עקבי וחיובי והם צריכים לעבור אילוף מקצועי ונכון על מנת שלא יהיו תוקפניים. \n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "דיספלסיה של המפרק, בעיות עיניים, בעיות נשימה ואפילו חסימה של דרכי הנשימה וזיהומים בעור.\n" +
                    "הנקבות בדרך כלל צריכות לעבור ניתוח קיסרי בגלל הראש הרחב של הגורים. חשוב מאוד להשגיח על הבולדוג בכל פעם שהוא נמצא תחת הרדמה מכיוון שהם יכולים ללקות בסיבוך נשימתי.\n";
        }

        if (race.equals("בולדוג צרפתי")) {
            tip_race = "תוחלת חיים ממוצעת 8-10 שנים.\n" +
                    "הבולדוג הצרפתי מתאים לגידול בדירה ,מאוד ידידותי עם ילדים קטנים ודורש המון תשומת לב ויחס . \n" +
                    "הם מאוד עקשניים ולכן לא קלים לאילוף, הם מתקשים לפעול על פי פקודות ובעקבות זה על מנת ללמד אותם לבצע פקודה מסוימת זה ייקח זמן ואימון רב שדורש סבלנות ואיפוק.\n" +
                    "מאוד מומלץ ללמד אותם לאלף אותם ברמה הבסיסית אחרת הם לא יהיו נעימים ובנוסף רצוי לסרס את הזכרים על מנת להקל על האילוף (אלא אם כן רוצים להרביע אותם ) ורצוי שהאילוף יהיה בגיל צעיר ככל הניתן כדי לקבל תוצאות נהדרות ולשפר את החיים המשותפים איתם . \n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "בעיות נשימה ובעיות בעיניים. אם הם סובלים מהשמנת יתר, הדבר יכול להשפיע על הנשימה שלהם ולגרום לבעיות רציניות יותר. בולדוגים צרפתיים רבים נוטים לנחור ולהשמיע צפצופים. הבולדוגים מעדיפים ומרגישים יותר טוב בקור מאשר בחום. בעיה נוספת שהם יכולים לסבול ממנה היא יובש בעור, שיכול ליצור קרחות קטנות בעור שניתנות לטיפול באמצעות תרופה להקלה על עור יבש.\n";
        }

        if (race.equals("גולדן רטריבר")) {
            tip_race = "תוחלת חיים ממוצעת 12-15 שנים.\n" +
                    "כלבים אלו מתאימים לגידול בדירה ומסתדרים מעולה עם ילדים קטנים . \n" +
                    "הם משפחתיים מאוד ומסתדרים בנוסף עם בעלי חיים נוספים . \n" +
                    "דורשים המון תשומת לב ויחס , הם מאוד אוהבים לרגיש חום ואהבה מהבעלים שלהם .\n" +
                    "הם לא מתאימים להיות כלבי שמירה מכיוון שהם ידידותיים מאוד עם הסביבה ולא מאיימים . \n" +
                    "כלבי הגולדן רטריבר ידועים באילופם הקל, הם נלהבים ללמוד ולהוטים לרצות, האינטליגנציה הגבוהה שלהם מאפשרת להם ללמוד תרגילים חדשים בקלות ובמהירות. כלבי הגולדן טובים בללמוד כיצד לבצע עבודות, לכן הם עובדים עם המשטרה באיתור סמים וכדומה.\n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "דיספלסיה של המפרק שיכולה לגרום לחוסר נוחות קיצוני, נפיחות, דלקת פרקים ואפילו פציעה.\n" +
                    " קטרקט, אפילפסיה, אלרגיות עור ומחלות לב תורשתיות, נשירה שניתן למנוע על ידי סירוק מתמיד של פרוותם בעיקר בעונת האביב . \n";
        }

        if (race.equals("דוברמן")) {
            tip_race = "תוחלת חיים ממוצעת 13 שנים.\n" +
                    "תוקפני לעיתים רחוקות והוא מתאים גם לשמש ככלב משפחה ויכול גם לשמש ככלב שמירה  .\n" +
                    "דוברמן הוא כלב חכם ורגיש מאוד ובעל אופי רגוע, יציב ומהימן. הוא נאמן מאוד לבעליו והתייחסות שלו לזרים חשדנית, אך לרוב לא יתקוף אם אינו מרגיש איום מצדו של הזר. \n" +
                    "הדוברמן הוא כלב אנרגטי מאוד, ולכן זקוק לשטח מחיה גדול ולפחות ל-3 טיולים ביום, הכוללים ריצה ופעילות ספורטיבי.\n" +
                    "הדוברמן קל מאוד לאילוף. יש צורך להציב לו גבולות, אולם אין צורך ללמדו לשמור, מאחר וככלב שמירה זהו אינסטינקט מולד עבורו. \n" +
                    "מומלץ תוך כדי האילוף, יש לאפשר לו פעילות פיזית רבה, כדי לשחרר אנרגיות.\n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "הדוברמן בריא בדרך כלל אך נוטה לבעיות גב , למחלה האורתופדית היפדיספלסיה, להפרעות גנטיות בזרימת הדם והשמנה בגיל בוגר ולבעיות לב, כך שמומלץ לנהל שגרת מעקב אצל וטרינר, וכן לבדוק את מצבו הבריאותי לפני אימוץ או רכישה.\n";
        }

        if (race.equals("האסקי סיבירי")) {
            tip_race ="תוחלת חיים ממוצעת 12-14 שנים.\n" +
                    "ידידותי לסביבה ,מאוד מתאים במיוחד לגידול עם ילדים ומסתדר עם כלבים אחרים . \n" +
                    "כלב זה הוא זריז ואתלטי . זהו גזע אינטליגנטי, ידידותי ועדין והוא בדרך כלל נקשר מאוד לאדם אחד מבני המשפחה .\n" +
                    "קל מאוד לאילוף, כלבים מהסוג הזה יכולים להיות מאומנים לעשות כמעט הכל אך יש צורף באילוף טוב , סבלנות ולהראות לכלב שאתם המנהיגים וכך הם ילמדו לכבד אתכם . \n" +
                    "גזע זה זקוק לחברה ולהמון תשומת לב . \n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "דיספלסיה של המפרק ובעיות עיניים. מבחינת טיפול מדובר בכלב נוח מאוד, הוא מטבעו נקי מאוד ואינו סובל מריחות גוף וטפילים, הסיביריים מנקים עצמם כמו חתולים. \n" +
                    "הנשירה של הפרווה מתרחשת פעמיים בשנה והיא אינטנסיבית מאוד, אפשר להבריש אותם מידי פעם כדי להסיר שיער מת וכדי שהפרווה תמשיך להבריק. \n";
                    }

        if (race.equals("וויט טרייר")) {
            tip_race ="תוחלת חיים ממוצעת 16 שנים.\n" +
                    "ידידותי לסביבה, מאוד מתאים לגידול עם ילדים ומאוד חברותי לסביבה , לרוב לא מסתדר עם חיות מחמד אחרות אבל אם בכל זאת בוחרים בכך צריך לעשות זאת בהמון סבלנות ולתת לו זמן להתרגל לחיית מחמד הנוספת.\n" +
                    "סוג זה של כלבים מתאים גם לגידול בדירה.\n" +
                    "כלבים אלו רעשניים במיוחד, אוהבים לנבוח ויש להם המון אנרגיה ולכן זה דורש מהבעלים שלהם להוציא אותם לטיולים רבים , לשחק איתם ולהקדיש להם זמן ותשומת לב . \n" +
                    "כלבי הווסטי הם אמיצים, אינטליגנטיים, עצמאיים, עקשניים ועם המון הערכה עצמית – תכונות מגוונות אלו יכולות להפוך את האילוף שלהם לאתגר. חשוב שכלבים אלו לא יהפכו לשתלטניים ותוקפניים כי הם עשויים לתקוף ולנשוך. הם צריכים לדעת קודם כל את הפקודות הבסיסיות כגון: לשבת, לבוא, להישאר, למטה וכדומה. האילוף צריך להיות נוקשה אך חיובי. הקפידו לסיים כל אילוף עם פקודה שהכלב שלכם כבר יודע כדי שהוא ירגיש טוב לגביי ההישגים שלו.\n" +
                    "מבחינה בריאותית- כלבי הווסטי נחשבים לכלבים בריאים עם בעיות בריאותיות מועטות .\n" +
                    "הם צריכים להיות רגילים לטיפוח מגיל צעיר בעיקר בהברשתו וטיפול בפרווה שלהם.\n";
        }

        if (race.equals("לברדור")) {
            tip_race ="תוחלת חיים ממוצעת 12-14 שנים.\n" +
                    "ידידותי לסביבה, מאוד מתאים לגידול עם ילדים ומאוד חברותי לסביבה , מתאים גם לגידול בדירה.\n" +
                    "לברדורים הם גזע שתלוי בבני אדם במידה גדולה מאוד. הם לא רוצים רק מזון ושתייה ממך. הם זקוקים לך כחבר וישמחו שתשחק איתם ותצא איתם לפעילויות בחוץ. כשלברדור אינו זוכה לחינוך נכון הוא הופך לכלב שקשה לשלוט בו. אם מצטברת אצלם הרבה אנרגיה שאינה משתחררת בהליכה או ריצה, הם עלולים להשחיז את שיניהם באמצעות הרהיט הקרוב אליהם, כדי לפוגג את השעמום. כלבי לברדור זקוקים להרבה תשומת לב וחיבה מצד בעליהם.\n" +
                    "מומלץ לאלף אותם למשמעת בגיל 7-20 שבועות ומתן תשומת לב יהפכו אתכם לחברים הכי טובים בעולם.\n" +
                    "לא מומלץ לקלח אותם המון פעמים אך מומלץ להבריש את פרוותם לפחות פעם בשבוע על מנת לשמוע על ההיגיינה שלהם.\n" +
                    "מבחינה בריאותית- לרוב הם כלבים בריאים אך ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן: \n" +
                    "דיספלסיה של המפרק. כמו כן, הם נוטים למחלות עיניים כגון ניוון רשתית.\n";
        }

        if (race.equals("פודל")) {
            tip_race ="תוחלת חיים ממוצעת 10-18 שנים.\n" +
                    "הפודל הוא שקט ורגוע בבית, אך אקטיבי ונמרץ בחוץ. הפודל חברותי ומסתדר היטב הן עם אנשים והן עם כלבים אחרים. \n" +
                    "הדחף שלו לרדוף ולהחזיר חפצים לבעליו. הוא ערני מאוד ולכן יכול לשמש גם להתרעה מפני הגעת זרים. כאשר ילדים מתקרבים אליו, הוא עלול לנשוך מתוך פחד ולכן כשיש ילדים קטנים בסביבתו כדאי שתהיה השגחת מבוגר. מומלץ לגדל אותו בבתים שבו ילדים מעט מבוגרים יותר.\n" +
                    "הם מתאימים לגידול בדירה.\n" +
                    "פודלים בטבעם ירצו לרצות את בעליהם והם מאוד נוחים לאילוף בזכות האינטליגנציה שלהם הם יכולים ללמוד מגוון רחב של תרגילים תוך זמן קצר במיוחד, לכן גם אנשים ללא רקע באילוף יוכלו לאלף באופן בסיסי את כלביהם.\n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "מחלות עיניים, קטרקט ודלקות אוזניים, הנובעות ממגע הפרווה הלא נקייה בעיניים ובאוזניים ומהיעדר אוורור של חלל האוזן. כדי למנוע בעיות כאלו יש להבריש את הפודל לעיתים קרובות ולשמור על ניקיון פרוותו. הפרווה המתולתלת עלולה להקשות על הפודל לעמוד בעומס חום ולכן יש ולהקפיד לספר אותו, כדי להקל עליו בימי הקיץ.\n" +
                    "בעיות בריאות נוספות האופייניות לפודלים הן: היפוך קיבה, בעיות בבלוטת התריס ואפילפסיה. בשלב מאוחר בחייו, נוטה הפודל לסבול גם מבעיות הקשורות לעצמות ולשרירים.\n";
        }

        if (race.equals("פקינז")) {
            tip_race ="תוחלת חיים ממוצעת 12-15 שנים.\n" +
                    "מתאימים מאוד עם גידול עם ילדים קטנים וגם לגידול בדירה.\n" +
                    "הם מאוד נאמנים לבעליהם וקנאים להם.\n" +
                    "רמת האילוף האפשרית של הפקינז היא מוגבלת מאוד. אולם, עדיין אפשרי ומומלץ לאלפו לציית לפקודות בסיסיות (כמו שב, ארצה, תן יד וכו') כדי למנוע התנהגויות שליליות אופייניות, כגון: עקשנות, קינאה, חרדת נטישה, נהימות, נשיכות ונבחנות, חשדנות מוגזמת כלפי זרים ואף אלימות בקרבת ילדים ומבוגרים.\n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "עקב מבנה עיניו, הפקינז מועד לסבול מבעיות עיניים, הנובעות מגידול הריסים אל תוך העין. הפקינזים בעלי הפרווה הארוכה עלולים לסבול גם מדלקות אוזניים. לכן מומלץ להקפיד לבדוק את העיניים ואת האוזניים בשעת הטיול היומית. גם ניקוי הפנים על בסיס יום יומי, בעיקר בין קפלי האף ומסביב לעיניים, יועיל.\n" +
                    "בנוסף לכך, הפקינז נוטה לסבול מפריצות דיסק ומבעיות גב וברכיים, ולעיתים אף מבעיות נשימה, מבעיות לב ומסוכרת. נקבות הפקינז סובלות מלידות קשות מאוד. ככלל, הפקינזים הינם בעלי נטייה להשמנה.\n";
        }
        if (race.equals("רוטווילר")) {
            tip_race ="תוחלת חיים ממוצעת 9-10 שנים.\n" +
                    "כלבי הרוטווילר הם כלבי שמירה מצוינים ולרוב הם מסוכנים אך ביחד עם זאת הם נאמנים לבעליהם ואוהבים אותם מאוד והם מאוד חברותיים עם בני הבית שבו הם הגדלים. הילדים יהיו אהובים על ידי כלבים אלו והמבוגרים יזכו לכבוד עם האילוף הנכון. \n" +
                    "הם זקוקים לאילוף מקצועי ונכון וכך הם לא יהפכו לכלבים תוקפניים והם יהיו כלבים ידידותיים לסביבה.\n" +
                    "כלבי הרוטוויילר הם כלבים אינטליגנטים מאוד וניתן בקלות לאלף אותם ומומלץ מאוד בגיל צעיר ככל האפשר. הם חייבים גם לעבור תהליך חברות עקבי באמצעות שילובם מוקדם ככל האפשר עם כלבים אחרים, אנשים זרים ומצבים חדשים. האילוף צריך להיות בראש ובראשונה לכבד ולציית לכל בני המשפחה ולהתנהג כראוי עם ילדים.\n" +
                    "אם כלב הרוטוויילר נשאר לבדו לפרק זמן ארוכים הוא יכול להיות הרסני מאוד. כדאי להרגיל אותם לישון במקום קבוע כדי ששם הוא יחכה לבעליו ויהיה שקט להשאירו לבד. \n" +
                    "מבחינה בריאותית- ישנם מספר בעיות בריאות פוטנציאליות שיש לדעת עליהן:\n" +
                    "דיספרסיה של מפרק הירך והמרפק, עיוות זה יכול להוביל לשיתוק ולבעיה בעצם ובסחוס שנקראת OCDD . ניתן למנוע תופעה זו על ידי פעילות גופנית נכונה ולוודא שכגורים הם אינם סובלים מלחץ מאף סוג שהוא. ניתן לעשות זאת על ידי הגבלת הגישה של הגורים למדרגות, לאסור על הרוטוויילר לקפוץ ולא לרוץ יותר מידי עם הכלב. הליכה פשוטה ומשחקים עם הכלב בכל יום יכולים להיות פעילות מספקת לגור הרוטוויילר.\n" +
                    "בעיות בריאות בעיניים יכולות לעבור בתורשה. כלבים אלו גם רגישים להשמנה ועליכם להקפיד עמם על המזון ובעיקר לפצל את האכלה לאורך כל היום, על ידי נתינת כמויות קטנות בכל פעם.\n" +
                    "לכלבי הרוטוויילר פרווה קצרה יחסית שאינה דורשת הרבה טיפוח מלבד הברשה יומית.\n";
        }

        if (race.equals("אביסני")) {
            tip_race ="תוחלת חיים ממוצעת 9-15 שנים.\n" +
                    "הנקבות מזן זה ממליטות רק 3 4 גורים.\n" +
                    " החתולים האביסינים הם חתולים סקרנים אינטליגנטיים ואנרגטיים, הם אינם חתולים שישבו על ברכי הבעלים, הם מאוד שובבים, נהנים מציד ואוהבים חופש.\n";
        }
        if (race.equals("אנגורה")) {
            tip_race ="חתול מגזע זה שייך לקטגוריה של בעלי השיער הארוך למחצה, פרוותם נעימה ועדינה במיוחד. \n" +
                    "החתול הוא אתלטי ואוהב מאוד לשחק, הוא חיית מחמד אהובה על ידי בני המשפחה.\n" +
                    " החתול האנגורי מעדיף את חברת בני האדם והוא מסור ונאמן לבעלים שלו.\n";
        }
        if (race.equals("בנגלי")) {
            tip_race ="חתול בעל מראה אקזוטי שאוהב לשחק, חכם מאוד ואוהב את בני משפחתו. \n" +
                    "בניגוד לחתולים אחרים, חתולים אלו אוהבים מים ואפילו יקפצו בשמחה לכיור או לאמבטיה עם מים רדודים, אפשר לאמן חתולים אלו בקלות ללכת עם רצועה. \n" +
                    "החתולים הבנגלים אוהבים לקפוץ ולטפס למקומות גבוהים והם לומדים לבצע טריקים דיי בקלות.\n";
        }
        if (race.equals("בריטי קצר שיער")) {
            tip_race ="תוחלת החיים שלהם יכולה להגיע עד 20 שנים.\n" +
                    "הזכרים גדולים יותר מהנקבות והמשקל שלהם יכול להגיע עד 10 ק\"ג.\n" +
                    "הוא בן לוויה נהדר, הם מאוד חכמים ויש להם אופי נוח. \n" +
                    "החתול הבריטי קצר שיער מאוד מודע לסביבה שלו, חתול עצמאי זה, אוהב חופש והוא מעדיף להיות על הרצפה בשל גודלו, הם מגיעים לבגרות מלאה לאחר שלוש עד חמש שנים.\n";
        }
        if (race.equals("הימלאיה")) {
            tip_race ="לחתולים מגזע הימלאיה יש מזג טוב והם אינם אוהבים לזוז יותר מידי, אלא מעדיפים להעביר את רוב הזמן שלהם בשינה. \n" +
                    "הם יכולים להיות גם פעילים ולשחק, אך הם נהנים לא פחות מנמנום על הברכיים של הבעלים שלהם.\n" +
                    "הם מאוד סקרניים ואוהבים להיות חלק מכל דבר שתעשו, הם בדרך כלל אינם קופצים, רצים או מטפסים, אלא אם יש להם התפרצות של אנרגיה תוך כדי משחק. \n" +
                    "חתולי ההימלאיה הם קולניים פחות מחתולים אחרים ויכולים להסתגל היטב לחיים בדירה.\n";
        }
        if (race.equals("סומאלי")) {
            tip_race ="החתולים מגזע סומלי שייכים לקטגוריה של שיער ארוך למחצה, חתולים אלו זקוקים להמון תשומת לב והם לא אוהבים להיות סגורים בתוך הבית. \n" +
                    "הם חתולים אוהבים, חכמים, מלאי אנרגיה שאותה הם מוציאים באמצעות משחק. \n" +
                    "חתולים אלו מתבגרים לאיטם ומגיעים לגודל מלא רק בגיל 18 חודשים. \n" +
                    "הנקבה ממליטה שלושה עד ארבעה גורים בכל המלטה.\n";
        }
        if (race.equals("סיאמי")) {
            tip_race ="החתולים הסיאמיים הם חתולים בעלי מזג נוח והם נאמנים ואוהבים מאוד את בעליהם. \n" +
                    "הם לא יסתדרו זמן רב מידי לבדם, לכן הם מתאימים לגידול אצל אנשים ששוהים הרבה זמן בבית.\n" +
                    " אם אתם נוטים להיעדר לזמן ממושך מהבית, אפשר להביא להם חתול נוסף שישמש להם כחברה, בזמן שאתם לא נמצאים. \n" +
                    "החתולים הסיאמיים דורשים המון תשומת לב . \n";
        }
        if (race.equals("רגדול")) {
            tip_race ="חתול שקט שאינו מילל כמעט בכלל, קל לגידול בזכות אופיו הרגוע והיעדר נטיות תוקפניות לחלוטין, גם כאשר הוא מותקף. \n" +
                    "מאוד אוהב תשומת לב ורמת האינטליגנטיות הגבוהה שלו מאפשרת לו ללמוד לעשות דברים חדשים. חתולי הרגדול ידועים בשל סף הכאב הגבוה שלהם וההרפיה המוחלטת של הגוף, תכונה שמופיעה אצל כל החתולים מגזע זה.\n" +
                    " חתול הרגדול מסתדר היטב עם ילדים וכלבים. \n" +
                    "מומלץ לא לתת לחתול רגדול להסתובב בחוץ מכיוון שהוא אינו מגן על עצמו כאשר תוקפים אותו.\n" +
                    "הזכרים יותר גדולים מהנקבות .\n";
        }



        tip_animal.setText(tip_race);




        findViewById(R.id.vec).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(fullad.this , personalveccine.class);
                intent.putExtra("type" , type);
                startActivity(intent);
            }
        });


        findViewById(R.id.contact).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(fullad.this , contactfullad.class);
                startActivity(intent);
            }
        });


    }





}
