package com.eran.myapp;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class tips extends AppCompatActivity {

    TextView tipim;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_tips);
        tipim = (TextView)findViewById(R.id.textTipsView);

        String tip="טיפים כללים למאמץ המתחיל:\n" +
                "\n" +
                "1.\tהתאמה לסגנון החיים שלך -\n" +
                "לפני שמתחילים את תהליך האימוץ יש לוודא מספר פרמטרים במטרה לספק עבור בעל החיים החדש את התנאים הרצויים לגבי אורח החיים שלכם, למשל שעות עבודה או שעות בהן בעל החיים ישאר לבדו בבית, ילדים המתגוררים בבית, תדירות נסיעות למניהן וכו'\n" +
                "\n" +
                "2.\tלימוד והיכרות – \n" +
                "לפני בחירת בעל החיים אותו תרצו לאמץ, יש ללמוד על בעל החיים ועל אופן סגנון החיים שלו  במטרה לקבל מושג בנוגע לתכונות המאפיינות גזה מסויים ולהחליט על פי נתונים אלו האם בעל החיים ישתלב בצורה טובה בחייכם ובחיי משפחתכם.\n" +
                "במידה ומצאתם את בעל החיים המתאים, מומלץ לבצע היכרות של בעל החיים הספציפי אותו בחרתם לאמץ, למשל לבקר אותו מראש על מנת שיכיר את ריח הבעלים החדש שלו או לברר עם הבעלים הקודמים על אופיו.\n" +
                "\n" +
                "3.\tהתאמה לסביבת המגורים – \n" +
                "רוב בעלי החיים צריכים סביבה המתאימה לאופי חייהם כגון גינה או מרפסת, לכן לפני הכנסת בעל החיים החדש לביתכם יש להכין את מקום המגורים בצורה הקרובה ביותר לסביבה הנדרשת, בנוסף יש לוודא שסביבת המגורים הרלוונטית מאפשרת את האימוץ (כמו דירה שכורה המצריכה אישור מבעל הבית או חצר סגורה וכדומה).\n" +
                "\n" +
                "4.\tמצב כלכלי – \n" +
                "מעבר לבדיקת תנאי המחייה, התאמת הסביבה והרצון לאמץ בעל חיים, יש לוודא כי קיים מצב כלכלי המאפשר את תהליך האימוץ מעבר להוצאות חד פעמיות כמו עלות המזון החודשית, טיפולים, חיסונים, ביקור אצל הווטרינר וכו'..\n" +
                "\n" +
                "5.\tתוחלת החיים של בעל החיים המאומץ – \n" +
                "יש לבדוק, בהתאם לתוחלת החיים של בעל החיים הנבחר, כי יש ביכולתכם לדאוג לו בזמן הנדרש ולוודא כי אתם בנויים למחוייבות ארוכת טווח.\n" +
                "\n" +
                "6.\tהזמן המתאים – \n" +
                "בחירת זמן האימוץ חשובה ביותר לתהליך עצמו ולכן מומלץ לבדוק מספר גורמים לפני תחילתו כמו האם יש בעל חיים נוסף בבית והאם הם יסתדרו? האם יש תינוק בבית המאפשר את הכנסת בעל החיים? האם המצב הבריאותי שלכם מאפשר הכנסת בעל חיים? בדיקות אלו עלולות למנוע מצבים בעייתים בעתיד.\n";

        tipim.setText(tip);
        tipim.setMovementMethod(new ScrollingMovementMethod());

    }
}
